const resource = {
  "index": {
    "name": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Евченко Максим" } },
    "description": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Frontend-разработчик с многолетним опытом создания современных веб-приложений. Имею навыки работы с Vue.js, Nuxt.js, TypeScript, Tailwind CSS и другими технологиями для разработки высококачественных пользовательских интерфейсов." } },
    "buttons": {
      "projects": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Мои проекты" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/projects" } }
      },
      "about": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Обо мне" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/about" } }
      }
    },
    "skills": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Основные инструменты разработки" } },
    "seo": {
      "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Frontend Developer - Евченко Максим" } },
      "description": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Евченко Максим - Frontend-разработчик с многолетним опытом создания современных веб-приложений. Имеет навыки работы с Vue.js, Nuxt.js, TypeScript, Tailwind CSS и другими технологиями для разработки высококачественных пользовательских интерфейсов" } }
    }
  },
  "jobs": {
    "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Опыт работы" } },
    "block_info": {
      "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Дополнительная информация" } },
      "description": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "На протяжении жизненного пути я работал программистом еще в ряде мест и изучил такие языки как PHP, C, C++, C# но их я в данном списке не указываю так как они не относятся к моей основной специализации" } }
    },
    "seo": {
      "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Опыт работы - Евченко Максим" } },
      "description": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Список мест работы, на которых работал Евченко Максим, Frontend-разработчик с многолетним опытом создания современных веб-приложений." } }
    },
    "buttons": {
      "prev": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Главная" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/" } }
      },
      "next": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Навыки" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/skills" } }
      }
    }
  },
  "skills": {
    "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Навыки и технологии" } },
    "subtitle": {
      "first": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Основные инструменты" } },
      "second": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Дополнительные инструменты" } }
    },
    "block_info": {
      "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Дополнительная информация" } },
      "description": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Так же имеются знания языков C, C++, C# и различных технологий и библеотек их я в данном списке не указываю так как они не относятся к моей основной специализации но я готов использовать их при необходимости." } }
    },
    "seo": {
      "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Навыки и технологии - Евченко Максим" } },
      "description": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Список навыков и инструментов, которыми владеет Евченко Максим, Frontend-разработчик с многолетним опытом создания современных веб-приложений." } }
    },
    "buttons": {
      "prev": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Опыт работы" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/jobs" } }
      },
      "next": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Мои проекты" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/projects" } }
      }
    }
  },
  "projects": {
    "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Список проектов" } },
    "seo": {
      "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Проекты - Евченко Максим" } },
      "description": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Список проектов, в которых участвовал Евченко Максим, Frontend-разработчик с многолетним опытом создания современных веб-приложений." } }
    },
    "buttons": {
      "prev": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Навыки" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/skills" } }
      },
      "next": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Обо мне" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/about" } }
      }
    }
  },
  "about": {
    "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Обо мне" } },
    "seo": {
      "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Обо мне - Евченко Максим" } },
      "description": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Евченко Максим - Frontend-разработчик с многолетним опытом создания современных веб-приложений. Имеет навыки работы с Vue.js, Nuxt.js, TypeScript, Tailwind CSS и другими технологиями для разработки высококачественных пользовательских интерфейсов." } }
    },
    "content": {
      "start_block": {
        "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Начало" } },
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Мой карьерный рост начался с работы на телевидении в рекламном отделе. Я работал дизайнером рекламных продуктов. В один прекрасный момент нашему рекламному агентству понадобилось сделать сайт с этого и началось мое знакомство с программированием и веб-разработкой. Мы создали сайт на Wordpress и после этого решили добавить услугу по созданию сайтов для наших клиентов. Но это было только начало. Я начал изучать веб-разработку и языки программирования познакомился с PHP, CSS и Javascript. Чем больше я изучал тем больше понимал что писать сайты на готовых движках или нативных языках это не практично и не гибко. Нужно изучать фреймворки первый из таких был Laravel." } }
      },
      "vue_block": {
        "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Vue.js и Front-End" } },
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Затем когда в Laravel добавили Vue.js я был в восторге от его возможностей и решил поменять свое направление на Front-End. Изучая Vue.js я познакомился и с Node.js технологией и углубился в изучение JavaScript и всех его нововведений. Со всеми технологиями веб-разработки описанными в разделе Знания технологий я познакомился в процессе решения задач на моем пути и накоплении опыта. Он весь расписан по годам в разделе" } },
        "link": {
          "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Опыт работы" } },
          "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/jobs" } }
        }
      },
      "nuxt_block": {
        "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Nuxt.js" } },
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Со временем я познакомился с Nuxt.js фреймворком и понял что это будущее веб-разработки. Я начал изучать его и использовать в своих проектах. Nuxt.js позволил мне создавать более сложные и масштабируемые приложения с меньшими затратами времени и усилий. Я также начал использовать TypeScript для улучшения качества кода и уменьшения количества ошибок." } }
      },
      "future_block": {
        "title": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Что дальше?" } },
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Сейчас я продолжаю изучать новые технологии и инструменты в веб-разработке. Как и Интернет который не стоит на месте так и я спешу за ним и стараюсь изучать новое и совершенствоваться. Все мои навыки и знания я применяю в своих проектах с ними вы можете посмотреть ознакомиться в разделе" } },
        "link": {
          "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Проекты" } },
          "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/projects" } }
        }
      }
    },
    "buttons": {
      "prev": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Проекты" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/projects" } }
      },
      "next": {
        "text": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "Главная" } },
        "to": { "t": 0, "b": { "t": 2, "i": [{ "t": 3 }], "s": "/" } }
      }
    }
  }
};

export { resource as default };
//# sourceMappingURL=ru-l4HpYNkP.mjs.map
